app/Controllers/AnggotaKelas.php

SELECT *
FROM `kelas`
SELECT *
FROM `tahun_pelajaran`
---
    public function index()
    {
        $kelasModel = new KelasModel();
        $tahunModel = new TahunPelajaranModel();
        $anggotaModel = new AnggotaKelasModel();

        $kelas_id = $this->request->getGet('kelas_id');
        $tahun_id = $this->request->getGet('tahun_id');

        $data = [
            'title' => 'Anggota Kelas',
            'kelasList' => $kelasModel->findAll(),
            'tahunList' => $tahunModel->findAll(),