app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);

        // Redirect to dashboard if already logged in
        if (session()->get('isLoggedIn')) {
            return redirect()->to('/dashboard');
        }

        $data = [
            'title' => 'Login | Perangkat Pembelajaran SMK'
        ];

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'username' => 'required|min_length[3]|max_length[50]',
                'password' => 'required|min_length[5]|max_length[255]',
            ];

            if ($this->validate($rules)) {
                $userModel = new UserModel();
                $user = $userModel->where('username', $this->request->getVar('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `users`.`deleted_at` IS NULL
 LIMIT 1