app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `gurus`
SELECT COUNT(*) AS `numrows`
FROM `siswas`
SELECT COUNT(*) AS `numrows`
FROM `kelas`
SELECT COUNT(*) AS `numrows`
FROM `mata_pelajaran`
SELECT COUNT(*) AS `numrows`
FROM `materi`
SELECT COUNT(*) AS `numrows`
FROM `ulangan`
SELECT COUNT(*) AS `numrows`
FROM `jadwal`
SELECT COUNT(*) AS `numrows`
FROM `jawaban_siswa`
WHERE `status` = 'Selesai'
---
    private function statsAdmin($db): array
    {
        $stats = [
            'total_guru'    => $db->table('gurus')->countAllResults(),
            'total_siswa'   => $db->table('siswas')->countAllResults(),
            'total_kelas'   => $db->table('kelas')->countAllResults(),
            'total_mapel'   => $db->table('mata_pelajaran')->countAllResults(),
            'total_materi'  => $db->table('materi')->countAllResults(),
            'total_ulangan' => $db->table('ulangan')->countAllResults(),
            'total_jadwal'  => $db->table('jadwal')->countAllResults(),
            'total_ujian_selesai' => $db->table('jawaban_siswa')
                ->where('status', 'Selesai')->countAllResults(),

SELECT *
FROM `gurus`
WHERE `user_id` = '2'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `jadwal`
WHERE `guru_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `ulangan`
WHERE `guru_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `materi`
WHERE `guru_id` = 1
---
    private function statsGuru($db): array
    {
        $guruModel = new GuruModel();
        $guru      = $guruModel->where('user_id', session()->get('id'))->first();
        if (! $guru) return ['stats' => []];

        $guruId = (int)$guru['id'];

        $stats = [
            'total_jadwal'  => $db->table('jadwal')
                ->where('guru_id', $guruId)->countAllResults(),
            'total_materi'  => $db->table('materi')
                ->where('guru_id', $guruId)->countAllResults(),
            'total_ulangan' => $db->table('ulangan')
                ->where('guru_id', $guruId)->countAllResults(),