app/Controllers/Jadwal.php

SELECT *
FROM `kelas`
SELECT *
FROM `mata_pelajaran`
SELECT *
FROM `tahun_pelajaran`
WHERE `status` = 'Aktif'
SELECT *
FROM `gurus`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function index()
    {
        $role = session()->get('role');
        $jadwalModel = new JadwalModel();

        $data = ['title' => 'Jadwal Pelajaran'];

        if ($role == 'Admin') {
            $kelasModel = new KelasModel();
            $mapelModel = new MataPelajaranModel();
            $guruModel = new GuruModel();
            $tahunModel = new TahunPelajaranModel();

            $data['jadwals'] = $jadwalModel->getFullJadwal();
            $data['kelasList'] = $kelasModel->findAll();
            $data['mapelList'] = $mapelModel->findAll();
            $data['guruList'] = $guruModel->getGurus();
            $data['tahunList'] = $tahunModel->where('status', 'Aktif')->findAll();

            return view('jadwal/index_admin', $data);

        } elseif ($role == 'Guru') {
            $guruModel = new GuruModel();
            $guru = $guruModel->where('user_id', session()->get('id'))->first();