app/Controllers/Jurnal.php

SELECT *
FROM `gurus`
WHERE `user_id` = '2'
 LIMIT 1
---
    private function getGuru()
    {
        $guruModel = new GuruModel();
        return $guruModel->where('user_id', session()->get('id'))->first();