app/Controllers/MasterData.php

    public function tahun_pelajaran()
    {
        $model = new TahunPelajaranModel();
        $data = [
            'title' => 'Data Tahun Pelajaran',
            'tahuns' => $model->findAll()
---
SELECT *
FROM `tahun_pelajaran`

    public function toggle_status_tahun($id)
    {
        $model  = new TahunPelajaranModel();
        $tahun  = $model->find($id);

        if (! $tahun) {
            return redirect()->to('/master/tahun-pelajaran')->with('error', 'Data tidak ditemukan.');
        }

        if ($tahun['status'] === 'Tidak Aktif') {
            // Nonaktifkan semua dulu (hanya boleh 1 yang aktif)
            $model->where('status', 'Aktif')->set('status', 'Tidak Aktif')->update();
            // Aktifkan yang dipilih
            $model->update($id, ['status' => 'Aktif']);
            $msg = "Tahun pelajaran {$tahun['tahun']} ({$tahun['semester']}) sekarang Aktif.";
        } else {
            // Sudah aktif → nonaktifkan
            $model->update($id, ['status' => 'Tidak Aktif']);
---
SELECT *
FROM `tahun_pelajaran`
WHERE `tahun_pelajaran`.`id` = '2'
UPDATE `tahun_pelajaran` SET `status` = 'Tidak Aktif', `updated_at` = '2026-08-21 07:57:17'
WHERE `tahun_pelajaran`.`id` IN ('2')

    public function mata_pelajaran()
    {
        $model = new MataPelajaranModel();
        $data = [
            'title' => 'Data Mata Pelajaran',
            'mapels' => $model->findAll()
---
SELECT *
FROM `mata_pelajaran`