app/Controllers/MasterData.php

    public function mata_pelajaran()
    {
        $model = new MataPelajaranModel();
        $data = [
            'title' => 'Data Mata Pelajaran',
            'mapels' => $model->findAll()
---
SELECT *
FROM `mata_pelajaran`