app/Controllers/Presensi.php

    public function index()
    {
        $role = session()->get('role');
        $data = ['title' => 'Sistem Presensi'];

        if ($role == 'Guru') {
            $guruModel = new GuruModel();
            $jadwalModel = new JadwalModel();

            $guru = $guruModel->where('user_id', session()->get('id'))->first();
            $data['jadwalList'] = $guru ? $jadwalModel->getJadwalByGuru($guru['id']) : [];

            $db = \Config\Database::connect();
            if ($guru) {
                $builder = $db->table('presensi');
                $builder->select('presensi.*, kelas.nama_kelas, mata_pelajaran.nama_mapel, jadwal.hari, jadwal.jam_mulai');
                $builder->join('jadwal', 'jadwal.id = presensi.jadwal_id');
                $builder->join('kelas', 'kelas.id = jadwal.kelas_id');
                $builder->join('mata_pelajaran', 'mata_pelajaran.id = jadwal.mapel_id');
                $builder->where('jadwal.guru_id', $guru['id']);
                $builder->orderBy('presensi.tanggal', 'DESC');
                $data['riwayat'] = $builder->get()->getResultArray();
---
SELECT *
FROM `gurus`
WHERE `user_id` = '2'
 LIMIT 1
SELECT `presensi`.*, `kelas`.`nama_kelas`, `mata_pelajaran`.`nama_mapel`, `jadwal`.`hari`, `jadwal`.`jam_mulai`
FROM `presensi`
JOIN `jadwal` ON `jadwal`.`id` = `presensi`.`jadwal_id`
JOIN `kelas` ON `kelas`.`id` = `jadwal`.`kelas_id`
JOIN `mata_pelajaran` ON `mata_pelajaran`.`id` = `jadwal`.`mapel_id`
WHERE `jadwal`.`guru_id` = '1'
ORDER BY `presensi`.`tanggal` DESC