app/Models/AnggotaKelasModel.php

    public function getAnggotaByKelasTahun($kelas_id, $tahun_id)
    {
        return $this->select('anggota_kelas.*, siswas.nis, users.nama_lengkap, users.username')
                    ->join('siswas', 'siswas.id = anggota_kelas.siswa_id')
                    ->join('users', 'users.id = siswas.user_id')
                    ->where('anggota_kelas.kelas_id', $kelas_id)
                    ->where('anggota_kelas.tahun_pelajaran_id', $tahun_id)
                    ->findAll();
---
SELECT `anggota_kelas`.*, `siswas`.`nis`, `users`.`nama_lengkap`, `users`.`username`
FROM `anggota_kelas`
JOIN `siswas` ON `siswas`.`id` = `anggota_kelas`.`siswa_id`
JOIN `users` ON `users`.`id` = `siswas`.`user_id`
WHERE `anggota_kelas`.`kelas_id` = '3'
AND `anggota_kelas`.`tahun_pelajaran_id` = '3'