app/Models/GuruModel.php

SELECT `gurus`.*, `users`.`username`, `users`.`nama_lengkap`, `users`.`email`
FROM `gurus`
JOIN `users` ON `users`.`id` = `gurus`.`user_id`
---
    public function getGurus()
    {
        return $this->select('gurus.*, users.username, users.nama_lengkap, users.email')
                    ->join('users', 'users.id = gurus.user_id')
                    ->findAll();