app/Models/JadwalModel.php

SELECT `jadwal`.*, `kelas`.`nama_kelas`, `mata_pelajaran`.`nama_mapel`, `users`.`nama_lengkap` as `nama_guru`, `tahun_pelajaran`.`tahun`
FROM `jadwal`
JOIN `kelas` ON `kelas`.`id` = `jadwal`.`kelas_id`
JOIN `mata_pelajaran` ON `mata_pelajaran`.`id` = `jadwal`.`mapel_id`
JOIN `gurus` ON `gurus`.`id` = `jadwal`.`guru_id`
JOIN `users` ON `users`.`id` = `gurus`.`user_id`
JOIN `tahun_pelajaran` ON `tahun_pelajaran`.`id` = `jadwal`.`tahun_pelajaran_id`
---
    public function getFullJadwal()
    {
        return $this->select('jadwal.*, kelas.nama_kelas, mata_pelajaran.nama_mapel, users.nama_lengkap as nama_guru, tahun_pelajaran.tahun')
                    ->join('kelas', 'kelas.id = jadwal.kelas_id')
                    ->join('mata_pelajaran', 'mata_pelajaran.id = jadwal.mapel_id')
                    ->join('gurus', 'gurus.id = jadwal.guru_id')
                    ->join('users', 'users.id = gurus.user_id')
                    ->join('tahun_pelajaran', 'tahun_pelajaran.id = jadwal.tahun_pelajaran_id')
                    ->findAll();

SELECT `jadwal`.*, `kelas`.`nama_kelas`, `mata_pelajaran`.`nama_mapel`, `tahun_pelajaran`.`tahun`
FROM `jadwal`
JOIN `kelas` ON `kelas`.`id` = `jadwal`.`kelas_id`
JOIN `mata_pelajaran` ON `mata_pelajaran`.`id` = `jadwal`.`mapel_id`
JOIN `tahun_pelajaran` ON `tahun_pelajaran`.`id` = `jadwal`.`tahun_pelajaran_id`
WHERE `jadwal`.`guru_id` = 1
ORDER BY FIELD(hari, "Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu"), `jam_mulai`
---
    public function getJadwalByGuru($guru_id)
    {
        return $this->select('jadwal.*, kelas.nama_kelas, mata_pelajaran.nama_mapel, tahun_pelajaran.tahun')
                    ->join('kelas', 'kelas.id = jadwal.kelas_id')
                    ->join('mata_pelajaran', 'mata_pelajaran.id = jadwal.mapel_id')
                    ->join('tahun_pelajaran', 'tahun_pelajaran.id = jadwal.tahun_pelajaran_id')
                    ->where('jadwal.guru_id', $guru_id)
                    ->orderBy('FIELD(hari, "Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu"), jam_mulai')
                    ->findAll();