app/Models/JurnalModel.php

SELECT `jurnal_mengajar`.*, `jadwal`.`hari`, `kelas`.`nama_kelas`, `mata_pelajaran`.`nama_mapel`
FROM `jurnal_mengajar`
JOIN `jadwal` ON `jadwal`.`id` = `jurnal_mengajar`.`jadwal_id`
JOIN `kelas` ON `kelas`.`id` = `jadwal`.`kelas_id`
JOIN `mata_pelajaran` ON `mata_pelajaran`.`id` = `jadwal`.`mapel_id`
WHERE `jurnal_mengajar`.`guru_id` = '1'
ORDER BY `jurnal_mengajar`.`tanggal` DESC, `jurnal_mengajar`.`id` DESC
---
    public function getJurnalByGuru($guru_id)
    {
        return $this->select('jurnal_mengajar.*, jadwal.hari, kelas.nama_kelas, mata_pelajaran.nama_mapel')
                    ->join('jadwal', 'jadwal.id = jurnal_mengajar.jadwal_id')
                    ->join('kelas', 'kelas.id = jadwal.kelas_id')
                    ->join('mata_pelajaran', 'mata_pelajaran.id = jadwal.mapel_id')
                    ->where('jurnal_mengajar.guru_id', $guru_id)
                    ->orderBy('jurnal_mengajar.tanggal', 'DESC')
                    ->orderBy('jurnal_mengajar.id', 'DESC')
                    ->findAll();