app/Models/KelasModel.php

    public function getKelasWithWali()
    {
        return $this->select('kelas.*, gurus.nip, users.nama_lengkap as wali_kelas')
                    ->join('gurus', 'gurus.id = kelas.wali_kelas_id', 'left')
                    ->join('users', 'users.id = gurus.user_id', 'left')
                    ->findAll();
---
SELECT `kelas`.*, `gurus`.`nip`, `users`.`nama_lengkap` as `wali_kelas`
FROM `kelas`
LEFT JOIN `gurus` ON `gurus`.`id` = `kelas`.`wali_kelas_id`
LEFT JOIN `users` ON `users`.`id` = `gurus`.`user_id`