app/Models/PengaturanSekolahModel.php

SELECT *
FROM `pengaturan_sekolah`
 LIMIT 1
---
    public function getPengaturan(): array
    {
        $this->ensureTableExists();
        $data = $this->first();