app/Models/SiswaModel.php

    public function getSiswas()
    {
        return $this->select('siswas.*, users.username, users.nama_lengkap, users.email')
                    ->join('users', 'users.id = siswas.user_id')
                    ->findAll();
---
SELECT `siswas`.*, `users`.`username`, `users`.`nama_lengkap`, `users`.`email`
FROM `siswas`
JOIN `users` ON `users`.`id` = `siswas`.`user_id`